------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /home/ransom/phd-metrics-fall-2020/stata_mixlogit.log
  log type:  text
 opened on:  14 Aug 2020, 20:53:52

. 
. webuse nlswork, clear
(National Longitudinal Survey.  Young Women 14-26 years of age in 1968)

. drop if mi(occ_code) | mi(age) | mi(ln_wage) | mi(msp) | mi(race) | mi(collgrad) | mi(c_city)
(169 observations deleted)

. recode occ_code (8 9 10 11 12 = 7)
(occ_code: 4637 changes made)

. gen white = race==1

. mlogit occ_code age white collgrad, base(13)

Iteration 0:   log likelihood = -49053.088  
Iteration 1:   log likelihood = -45959.712  
Iteration 2:   log likelihood = -45305.271  
Iteration 3:   log likelihood = -43429.119  
Iteration 4:   log likelihood = -43235.923  
Iteration 5:   log likelihood = -43229.437  
Iteration 6:   log likelihood =  -43229.39  
Iteration 7:   log likelihood =  -43229.39  

Multinomial logistic regression                 Number of obs     =     28,365
                                                LR chi2(21)       =   11647.40
                                                Prob > chi2       =     0.0000
Log likelihood =  -43229.39                     Pseudo R2         =     0.1187

------------------------------------------------------------------------------
    occ_code |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
1            |
         age |  -.0022016   .0052761    -0.42   0.676    -.0125425    .0081393
       white |   .2536033   .0790581     3.21   0.001     .0986524    .4085543
    collgrad |  -2.150799   .0910158   -23.63   0.000    -2.329187   -1.972411
       _cons |   2.064822   .1915989    10.78   0.000     1.689295    2.440349
-------------+----------------------------------------------------------------
2            |
         age |   .0640264   .0062163    10.30   0.000     .0518426    .0762102
       white |   .4872778   .0989502     4.92   0.000     .2933389    .6812167
    collgrad |  -3.280289   .1023556   -32.05   0.000    -3.480902   -3.079676
       _cons |  -.5191678   .2282209    -2.27   0.023    -.9664726   -.0718629
-------------+----------------------------------------------------------------
3            |
         age |  -.0448671   .0052105    -8.61   0.000    -.0550795   -.0346547
       white |    .028293   .0767234     0.37   0.712    -.1220821    .1786681
    collgrad |  -4.554013   .0902343   -50.47   0.000    -4.730869   -4.377157
       _cons |   5.425254   .1871049    29.00   0.000     5.058535    5.791973
-------------+----------------------------------------------------------------
4            |
         age |  -.0483941   .0064957    -7.45   0.000    -.0611254   -.0356628
       white |    .513898    .104869     4.90   0.000     .3083586    .7194375
    collgrad |   -4.08463   .1178257   -34.67   0.000    -4.315565   -3.853696
       _cons |   2.968808   .2267852    13.09   0.000     2.524317    3.413298
-------------+----------------------------------------------------------------
5            |
         age |   .0062536   .0086416     0.72   0.469    -.0106836    .0231909
       white |  -.4414241   .1256848    -3.51   0.000    -.6877617   -.1950864
    collgrad |  -4.787551   .2043967   -23.42   0.000    -5.188161   -4.386941
       _cons |   1.050813   .2942369     3.57   0.000     .4741196    1.627507
-------------+----------------------------------------------------------------
6            |
         age |  -.0502911   .0056398    -8.92   0.000     -.061345   -.0392373
       white |  -1.083457   .0812246   -13.34   0.000    -1.242654   -.9242597
    collgrad |  -6.731732   .1779971   -37.82   0.000      -7.0806   -6.382864
       _cons |   5.439964   .1976946    27.52   0.000      5.05249    5.827438
-------------+----------------------------------------------------------------
7            |
         age |   -.048515   .0055107    -8.80   0.000    -.0593158   -.0377143
       white |  -.8564373   .0796378   -10.75   0.000    -1.012525   -.7003502
    collgrad |  -5.427005   .1128137   -48.11   0.000    -5.648116   -5.205894
       _cons |   5.431932   .1945405    27.92   0.000     5.050639    5.813224
-------------+----------------------------------------------------------------
13           |  (base outcome)
------------------------------------------------------------------------------

. 
. gen lnwage = ln_wage

. foreach j in 1 2 3 4 5 6 7 13 {
  2.     qui reg lnwage c.age##c.age b0.msp b0.white b0.collgrad b0.c_city if occ_code==`j'
  3.     predict elnwage`j', xb
  4. }

. 
. keep idcode year occ_code age white collgrad elnwage*

. preserve

.     ren elnwage13 elnwage8

.     recode occ_code (13 = 8)
(occ_code: 1644 changes made)

.     outsheet using nlsw88t.csv, comma replace nol

. restore

. 
. reshape long elnwage, i(idcode year occ_code age white collgrad) j(occ)
(note: j = 1 2 3 4 5 6 7 13)

Data                               wide   ->   long
-----------------------------------------------------------------------------
Number of obs.                    28365   ->  226920
Number of variables                  14   ->       8
j variable (8 values)                     ->   occ
xij variables:
        elnwage1 elnwage2 ... elnwage13   ->   elnwage
-----------------------------------------------------------------------------

. 
. gen chosen = occ==occ_code

. lab val occ occlbl

. drop occ_code

. drop if occ>7 & occ<13
(0 observations deleted)

. egen idyr = group(idcode year)

. 
. * multinomial logit (with Z's)

. asclogit chosen elnwage , case(idyr) alternatives(occ) casevars(age white collgrad) noconst base(13) vce(cluster idcode)

Iteration 0:   log pseudolikelihood = -46759.345  
Iteration 1:   log pseudolikelihood = -45101.398  
Iteration 2:   log pseudolikelihood = -44888.523  
Iteration 3:   log pseudolikelihood =  -44883.17  
Iteration 4:   log pseudolikelihood = -44883.168  

Alternative-specific conditional logit         Number of obs      =    226,920
Case variable: idyr                            Number of cases    =      28365

Alternative variable: occ                      Alts per case: min =          8
                                                              avg =        8.0
                                                              max =          8

                                                  Wald chi2(22)   =    5645.05
Log pseudolikelihood = -44883.168                 Prob > chi2     =     0.0000

                             (Std. Err. adjusted for 4,698 clusters in idcode)
------------------------------------------------------------------------------
             |               Robust
      chosen |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
occ          |
     elnwage |   1.307477   .2190098     5.97   0.000     .8782255    1.736728
-------------+----------------------------------------------------------------
1            |
         age |   .0403744   .0047338     8.53   0.000     .0310964    .0496524
       white |   .2439942   .1385019     1.76   0.078    -.0274645    .5154528
    collgrad |   -1.57132   .1494378   -10.51   0.000    -1.864213   -1.278427
-------------+----------------------------------------------------------------
2            |
         age |   .0433254   .0044045     9.84   0.000     .0346927    .0519582
       white |   .1468556   .1332037     1.10   0.270    -.1142188      .40793
    collgrad |  -2.959103   .1474433   -20.07   0.000    -3.248087    -2.67012
-------------+----------------------------------------------------------------
3            |
         age |   .1020574   .0041905    24.35   0.000     .0938441    .1102707
       white |   .7473086   .1389241     5.38   0.000     .4750224    1.019595
    collgrad |   -4.12005   .1598229   -25.78   0.000    -4.433297   -3.806803
-------------+----------------------------------------------------------------
4            |
         age |   .0375628   .0048265     7.78   0.000      .028103    .0470226
       white |   .6884899   .1490834     4.62   0.000     .3962917     .980688
    collgrad |   -3.65577   .1743835   -20.96   0.000    -3.997556   -3.313985
-------------+----------------------------------------------------------------
5            |
         age |   .0204543   .0057336     3.57   0.000     .0092167    .0316918
       white |  -.3584007   .1800903    -1.99   0.047    -.7113713   -.0054301
    collgrad |  -4.376929   .3406756   -12.85   0.000    -5.044641   -3.709217
-------------+----------------------------------------------------------------
6            |
         age |   .1074636   .0044118    24.36   0.000     .0988167    .1161105
       white |  -.5263738   .1521286    -3.46   0.001    -.8245405   -.2282072
    collgrad |  -6.199197   .2813733   -22.03   0.000    -6.750678   -5.647715
-------------+----------------------------------------------------------------
7            |
         age |   .1168824   .0045458    25.71   0.000     .1079728     .125792
       white |  -.2870554   .1432218    -2.00   0.045    -.5677649   -.0063459
    collgrad |  -5.322248   .1667047   -31.93   0.000    -5.648983   -4.995513
-------------+----------------------------------------------------------------
13           |  (base alternative)
------------------------------------------------------------------------------

. 
. * nested logit (with Z's)

. nlogitgen type = occ(white: 1 | 2 | 3, blue: 4 | 5 | 6 | 7, other: 13)
new variable type is generated with 3 groups
label list lb_type
lb_type:
           1 white
           2 blue
           3 other

. nlogittree occ type, choice(chosen) case(idyr)

tree structure specified for the nested logit model

 type    N        occ   N     k  
----------------------------------
 white  85095 --- 1   28365  3006
               |- 2   28365  1489
               +- 3   28365 10962
 blue  113460 --- 4   28365  1322
               |- 5   28365   437
               |- 6   28365  4298
               +- 7   28365  5207
 other  28365 --- 13  28365  1644
----------------------------------
              total  226920 28365

k = number of times alternative is chosen
N = number of observations at each level

Note: At least one case has only one alternative; nlogit will drop these cases.

. constraint 1 [other_tau]_cons = 1

. constraint 2 [1]_cons         = 0

. constraint 3 [4]_cons         = 0

. constraint 4 [4]white         = 0

. nlogit   chosen elnwage || type: age white collgrad,   base(blue) || occ:                   , noconst case(idyr) base(13) constraints(1)
note: branch 3 of level 1 is degenerate and the associated dissimilarity parameter ([other_tau]_cons) is not defined; see help nlogit for details

tree structure specified for the nested logit model

 type    N        occ   N     k  
----------------------------------
 white  85095 --- 1   28365  3006
               |- 2   28365  1489
               +- 3   28365 10962
 blue  113460 --- 4   28365  1322
               |- 5   28365   437
               |- 6   28365  4298
               +- 7   28365  5207
 other  28365 --- 13  28365  1644
----------------------------------
              total  226920 28365

k = number of times alternative is chosen
N = number of observations at each level

Iteration 0:   log likelihood =  -54417.78  
Iteration 1:   log likelihood = -54152.448  (backed up)
Iteration 2:   log likelihood = -53606.387  (backed up)
Iteration 3:   log likelihood = -51826.783  (backed up)
Iteration 4:   log likelihood = -51448.806  (backed up)
Iteration 5:   log likelihood = -51301.455  (backed up)
Iteration 6:   log likelihood = -51190.423  (backed up)
Iteration 7:   log likelihood = -51073.413  (backed up)
Iteration 8:   log likelihood = -51065.816  (backed up)
Iteration 9:   log likelihood = -51056.732  (backed up)
Iteration 10:  log likelihood =  -50821.03  
Iteration 11:  log likelihood =  -50736.57  
Iteration 12:  log likelihood = -50727.909  
Iteration 13:  log likelihood = -50724.492  
Iteration 14:  log likelihood =  -50722.43  
Iteration 15:  log likelihood = -50722.111  
Iteration 16:  log likelihood = -50721.989  
Iteration 17:  log likelihood = -50721.338  
Iteration 18:  log likelihood = -50721.009  
Iteration 19:  log likelihood = -50720.991  
Iteration 20:  log likelihood = -50720.991  

RUM-consistent nested logit regression         Number of obs      =    226,920
Case variable: idyr                            Number of cases    =      28365

Alternative variable: occ                      Alts per case: min =          8
                                                              avg =        8.0
                                                              max =          8

                                                  Wald chi2(7)    =    6053.18
Log likelihood = -50720.991                       Prob > chi2     =     0.0000

 ( 1)  [other_tau]_cons = 1
------------------------------------------------------------------------------
      chosen |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
occ          |
     elnwage |  -6.816762   .3403502   -20.03   0.000    -7.483836   -6.149688
------------------------------------------------------------------------------
type equations
------------------------------------------------------------------------------
white        |
         age |   .0571159    .002408    23.72   0.000     .0523963    .0618356
       white |   .5550848   .0327841    16.93   0.000     .4908292    .6193404
    collgrad |    1.00011   .0617306    16.20   0.000     .8791206      1.1211
-------------+----------------------------------------------------------------
blue         |
         age |          0  (base)
       white |          0  (base)
    collgrad |          0  (base)
-------------+----------------------------------------------------------------
other        |
         age |  -.0218581   .0050717    -4.31   0.000    -.0317985   -.0119178
       white |  -.8954591   .0793199   -11.29   0.000    -1.050923    -.739995
    collgrad |   6.321254   .1130222    55.93   0.000     6.099735    6.542774
------------------------------------------------------------------------------
dissimilarity parameters
------------------------------------------------------------------------------
type         |
  /white_tau |    2.27076    .159559                       1.95803     2.58349
   /blue_tau |   1.733183    .083052                      1.570404    1.895962
  /other_tau |          1  (constrained)
------------------------------------------------------------------------------
LR test for IIA (tau=1): chi2(2) = 121.35                 Prob > chi2 = 0.0000

. 
. * mixed logit (with Z's)

. asmixlogit chosen , case(idyr) alternatives(occ) casevars(age white collgrad) random(elnwage, normal) noconst base(13) vce(cluster idcode)
command asmixlogit is unrecognized
r(199);

. 
. log close
      name:  <unnamed>
       log:  /home/ransom/phd-metrics-fall-2020/stata_mixlogit.log
  log type:  text
 closed on:  14 Aug 2020, 20:58:50
------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
